Revit 2027 API
PartMakerMethodToDivideVolumes.AddIntersectingReference Method
 Adds intersecting reference with an offset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AddIntersectingReference(
	ElementId intersectingReference,
	double offset
)
Public Function AddIntersectingReference (
	intersectingReference As ElementId,
	offset As Double
) As Boolean
public:
bool AddIntersectingReference(
	ElementId^ intersectingReference,
	double offset
)
member AddIntersectingReference :
        intersectingReference : ElementId *
        offset : float -> bool
Parameters
intersectingReference ElementId
 Id of the new intersecting reference.
offset Double
 The Offste for the new intersecting reference.
Return Value
Boolean
 True if the PartMaker did not already use this intersecting reference and it was added, false if the PartMaker already used this intersecting reference and this call only updated its offset.
Exceptions
Exception | Condition
ArgumentException |  The element id was not permitted as intersecting references. Intersecting references should be levels, grids, or reference planes.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace